IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_ssi_regs.xml
<module id="SSI_REGS" HW_revision="" description="SSI Registers">
	<register id="SSICR0" width="32" page="1" offset="0x0" internal="0" description="SSI Control 0 ">
		<bitfield id="DSS" description="SSI Data Size Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="FRF" description="SSI FRame Format Select" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SPO" description="SSI Serial clock POlarity" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SPH" description="SSI Serial clock PHase" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SCR" description="SSI Serial Clock Rate" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="SSICR1" width="32" page="1" offset="0x4" internal="0" description="SSI Control 1 ">
		<bitfield id="LBM" description="SSI Loopback Mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SSE" description="SSI Synchronous Serial Port Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MS" description="SSI Master/Slave Select" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EOT" description="End of Transmission" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DIR" description="SSI Direction of Operation" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="HSCLKEN" description="High Speed Clock Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="FSSHLDFRM" description="FSS Hold Frame" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="SSIDR" width="32" page="1" offset="0x8" internal="0" description="SSI Data ">
		<bitfield id="DATA" description="SSI Receive/Transmit Data" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="SSISR" width="32" page="1" offset="0xc" internal="0" description="SSI Status ">
		<bitfield id="TFE" description="SSI Transmit FIFO Empty" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="TNF" description="SSI Transmit FIFO Not Full" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="RNE" description="SSI Receive FIFO Not Empty" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="RFF" description="SSI Receive FIFO Full" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="BSY" description="SSI Busy Bit" begin="4" end="4" width="1" rwaccess="R"/>
	</register>
	<register id="SSICPSR" width="32" page="1" offset="0x10" internal="0" description="SSI Clock Prescale      ">
		<bitfield id="CPSDVSR" description="SSI Clock Prescale Divisor" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSIIM" width="32" page="1" offset="0x14" internal="0" description="SSI Interrupt Mask      ">
		<bitfield id="RORIM" description="SSI Receive Overrun Interrupt Mask" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RTIM" description="SSI Receive Time-Out Interrupt Mask" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RXIM" description="SSI Receive FIFO Interrupt Mask" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TXIM" description="SSI Transmit FIFO Interrupt Mask" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DMARXIM" description="SSI Receive DMA Interrupt Mask" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DMATXIM" description="SSI Transmit DMA Interrupt Mask" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EOTIM" description="End of Transmit Interrupt Mask" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="SSIRIS" width="32" page="1" offset="0x18" internal="0" description="SSI Raw Interrupt Status      ">
		<bitfield id="RORRIS" description="SSI Receive Overrun Raw Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RTRIS" description="SSI Receive Time-Out Raw Interrupt Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="RXRIS" description="SSI Receive FIFO Raw Interrupt Status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="TXRIS" description="SSI Transmit FIFO Raw Interrupt Status " begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="DMARXRIS" description="SSI Receive DMA Raw Interrupt Status " begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="DMATXRIS" description="SSI Transmit DMA Raw Interrupt Status " begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EOTRIS" description="End of Transmit Raw Interrupt Status" begin="6" end="6" width="1" rwaccess="R"/>
	</register>
	<register id="SSIMIS" width="32" page="1" offset="0x1c" internal="0" description="SSI Masked Interrupt      Status ">
		<bitfield id="RORMIS" description="SSI Receive Overrun Masked Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RTMIS" description="SSI Receive Time-Out Masked Interrupt Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="RXMIS" description="SSI Receive FIFO Masked Interrupt Status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="TXMIS" description="SSI Transmit FIFO Masked Interrupt Status" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="DMARXMIS" description="SSI Receive DMA Masked Interrupt Status" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="DMATXMIS" description="SSI Transmit DMA Masked Interrupt Status" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EOTMIS" description="End of Transmit Masked Interrupt Status" begin="6" end="6" width="1" rwaccess="R"/>
	</register>
	<register id="SSIICR" width="32" page="1" offset="0x20" internal="0" description="SSI Interrupt Clear      ">
		<bitfield id="RORIC" description="SSI Receive Overrun Interrupt Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RTIC" description="SSI Receive Time-Out Interrupt Clear " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMARXIC" description="SSI Receive DMA Interrupt Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DMATXIC" description="SSI Transmit DMA Interrupt Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EOTIC" description="End of Transmit Interrupt Clear" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="SSIDMACTL" width="32" page="1" offset="0x24" internal="0" description="SSI DMA Control      ">
		<bitfield id="RXDMAE" description="Receive DMA Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TXDMAE" description="Transmit DMA Enable" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SSIPV" width="32" page="1" offset="0xfb0" internal="0" description="SSI Peripheral Version ">
		<bitfield id="MINOR" description="Minor Revision" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="MAJOR" description="Major Revision" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="SSIPP" width="32" page="1" offset="0xfc0" internal="0" description="SSI Peripheral Properties">
		<bitfield id="HSCLK" description="High Speed Capability" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MODE" description="Mode of Operation" begin="2" end="1" width="2" rwaccess="R"/>
		<bitfield id="FSSHLDFRM" description=" SSInFss Hold Frame Capability" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="SSIPC" width="32" page="1" offset="0xfc4" internal="0" description="SSI Peripheral      Configuration ">
	</register>
	<register id="SSIPeriphID4" width="32" page="1" offset="0xfd0" internal="0" description="SSI Peripheral      Identification 4 ">
		<bitfield id="PID4" description="SSI Peripheral ID Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="SSIPeriphID5" width="32" page="1" offset="0xfd4" internal="0" description="SSI Peripheral      Identification 5 ">
		<bitfield id="PID5" description="SSI Peripheral ID Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="SSIPeriphID6" width="32" page="1" offset="0xfd8" internal="0" description="SSI Peripheral      Identification 6 ">
		<bitfield id="PID6" description="SSI Peripheral ID Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="SSIPeriphID7" width="32" page="1" offset="0xfdc" internal="0" description="SSI Peripheral      Identification 7 ">
		<bitfield id="PID7" description="SSI Peripheral ID Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="SSIPeriphID0" width="32" page="1" offset="0xfe0" internal="0" description="SSI Peripheral      Identification 0 ">
		<bitfield id="PID0" description="SSI Peripheral ID Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="SSIPeriphID1" width="32" page="1" offset="0xfe4" internal="0" description="SSI Peripheral      Identification 1 ">
		<bitfield id="PID1" description="SSI Peripheral ID Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="SSIPeriphID2" width="32" page="1" offset="0xfe8" internal="0" description="SSI Peripheral      Identification 2 ">
		<bitfield id="PID2" description="SSI Peripheral ID Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="SSIPeriphID3" width="32" page="1" offset="0xfec" internal="0" description="SSI Peripheral      Identification 3 ">
		<bitfield id="PID3" description="SSI Peripheral ID Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="SSIPCellID0" width="32" page="1" offset="0xff0" internal="0" description="SSI PrimeCell      Identification 0 ">
		<bitfield id="CID0" description="SSI PrimeCell ID Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="SSIPCellID1" width="32" page="1" offset="0xff4" internal="0" description="SSI PrimeCell      Identification 1 ">
		<bitfield id="CID1" description="SSI PrimeCell ID Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="SSIPCellID2" width="32" page="1" offset="0xff8" internal="0" description="SSI PrimeCell      Identification 2 ">
		<bitfield id="CID2" description="SSI PrimeCell ID Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="SSIPCellID3" width="32" page="1" offset="0xffc" internal="0" description="SSI PrimeCell      Identification 3 ">
		<bitfield id="CID3" description="SSI PrimeCell ID Register" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
</module>
